================
CTI Outbound 6.0
================

:Author: Замечания к версии
:Date:   2019-08-27

.. contents::
   :depth: 3
..

.. raw:: html

   <div class="header">

.. rubric:: #. Соглашения и условные обозначения
   :class: p_Heading1

.. raw:: html

   </div>

Соглашения в документе

.. raw:: html

   <div
   style="text-align: justify; text-indent: 0px; padding: 0px 0px 0px 0px; margin: 0px 0px 0px 0px;">

+-----------------------------------------------------------------------------+
| .. raw:: html                                                               |
|                                                                             |
|    <div style="text-align: center;">                                        |
|                                                                             |
| |warning|                                                                   |
|                                                                             |
| .. raw:: html                                                               |
|                                                                             |
|    </div>                                                                   |
+-----------------------------------------------------------------------------+
| Внимание! Указывает на обязательное для исполнения или следования           |
| действие, или информацию.                                                   |
+-----------------------------------------------------------------------------+
| .. raw:: html                                                               |
|                                                                             |
|    <div style="text-align: center;">                                        |
|                                                                             |
| |information|                                                               |
|                                                                             |
| .. raw:: html                                                               |
|                                                                             |
|    </div>                                                                   |
+-----------------------------------------------------------------------------+
| Примечание. Указывает на необязательное для исполнения или следования       |
| действие, или информацию.                                                   |
+-----------------------------------------------------------------------------+


.. raw:: html

   </div>

 

Условные обозначения в документе

•Названия элементов интерфейса (названия пунктов меню, кнопок и пр.)
выделены полужирным шрифтом (например, ОК);

•Взаимоотношения между двумя фрагментами текста, при котором можно
осуществлять быстрый переход от одного фрагмента к другому, помечен
стилем гиперссылки;

•Элементы кода, переменные, программные составляющие выделены таким
шрифтом.

 

.. raw:: html

   <div class="header">

.. rubric:: #. Техническая поддержка и документация
   :class: p_Heading1

.. raw:: html

   </div>

Специалисты компании CTI обеспечивают техническую поддержку продукта CTI
Outbound. Общение со службой поддержки начинается с заполнения формы
открытия вопроса на сайте компании CTI в разделе "`Техническая
поддержка <http://sd.cti.ru>`__". Проблема немедленно поступит на
рассмотрение в инженерный отдел, вопросу будет присвоен соответствующий
статус, и будет отслеживаться история взаимодействий по нему.

 

Возможны следующие способы получения документации к системе CTI Outbound
6.0:

•Обращение в службу технической поддержки;

•Копирование с установочного диска;

•Установка в составе существующего инсталлятора.

 

Документы, входящие в состав системы CTI Outbound 6.0:

•CTI Outbound. Описание продукта;

•CTI Outbound. Замечания к версии;

•CTI Outbound. Матрица совместимости;

•CTI Outbound. Руководство администратора;

•CTI Outbound. Руководство разработчика;

•CTI Outbound Administrator. Руководство пользователя;

•CTI Outbound. Описание отчетности;

•CTI Outbound. Руководство инженера;

•CTIOutbound.Инструкция по установке и использованию фасадной базы
данных.

•CTI Outbound. Руководство по настройке зеркалирования;

•Панель управления CTI Outbound - Руководство администратора;

•Панель управления CTI Outbound - Руководство пользователя.

 

.. raw:: html

   <div class="header">

.. rubric:: #. Комплект поставки
   :class: p_Heading1

.. raw:: html

   </div>

В состав продукта CTI Outbound 6.0 входят:

1.Инсталлятор серверных компонент продукта CTI Outbound (CTI Outbound 6
Server--6.0.exe), включающий в себя:

▪Пакет документации (См. раздел "Техническая поддержка и документация");

▪Службу CTI Outbound Dialer;

▪Службу CTI Outbound Sip Caller;

▪Службу CTI Outbound Voice Analyzer;

▪CTI Configurator (служебная компонента, устанавливается автоматически
при установке службы CTI Outbound Dialer);

▪Примеры скриптов для Cisco IVR;

▪Утилиту проверки совершения SIP-звонка на уровне CTI Outbound Sip
Caller - SipCallPing.exe (устанавливается вместе с CTI Outbound SIP
Caller).

▪DialerApi.wsdl для интеграции внешних систем с системой исходящего
обзвона CTI Outbound;

2.Инсталлятор компонент интеграции с Cisco CVP для установки и настройки
компонент интеграции с Cisco CVP;

3.Папка DatabaseOutboud со скриптами для установки БД CTI Outbound;

4.Папка DatabaseStatistics со скриптами для установки БД CTI Outbound
Statistics;

5.Инсталлятор клиентской части CTI Outbound (CTI Outbound 6
Administrator--6.0) устанавливающий:

6.Инсталлятор для web приложения для управления исходящим обзвоном
(OutboundManagementUI-x32--6.0 или OutboundManagementUI-x64--6.0.exe);

7.Инсталлятор для web сервиса для управления исходящим обзвоном
(OutboundManagementApi-6.0);

8.Инсталлятор для web приложения "CTI Outbound Панель управления
вызовами" (OutboundCallHandler-x32--6.0.exe или
OutboundCallHandler-x64--6.0.exe).

.. raw:: html

   <div class="header">

.. rubric:: #. Требования к программному и аппаратному обеспечению
   :class: p_Heading1

.. raw:: html

   </div>

Минимальные требования к аппаратному обеспечению

•CPU x86 1,4GHz или выше;

•RAM 1Gb или выше. При установке на сервер с установленным MS SQL Server
- 1,5Gb или выше.

 

Рекомендуемые требования к аппаратному обеспечению

Рекомендуемые требования к аппаратному обеспечению рассчитываются исходя
из требований производительности системы и параметров совершаемых
вызовов. Для расчёта требований к аппаратному обеспечению определить
следующие параметры:

1.Режим совершения вызовов (TAPI/SIP);

2.Число одновременно работающих кампаний;

3.По каждой кампании:

•Режим работы (Preview, Predictive, Progressive2, ProgressiveIVR,
Progressive, Personalized Progressive);

•Ожидаемое число портов IVR, доступных для кампаний в Progressive2 и
ProgressiveIVR режимах;

•Максимальное число сценариев для кампаний в Progressive режиме;

•Ожидаемое число одновременно работающих агентов для кампаний в
Predictive и Preview режимах;

•Ожидаемая средняя продолжительность разговора;

•Ожидаемый процент успешных попыток дозвона до клиентов (для режима
Predictive необходимо учитывать звонки, отброшенные на этапе определения
факсов и автоответчиков, как неуспешные).

 

.. raw:: html

   <div
   style="text-align: justify; text-indent: 0px; padding: 0px 0px 0px 0px; margin: 0px 0px 0px 0px;">

+-----------------------------------------------------------------------------+
| .. raw:: html                                                               |
|                                                                             |
|    <div style="text-align: center;">                                        |
|                                                                             |
| |information|                                                               |
|   Примечание                                                                |
|                                                                             |
| .. raw:: html                                                               |
|                                                                             |
|    </div>                                                                   |
+-----------------------------------------------------------------------------+
| Например, для работы одной кампании в режиме Predictive при совершении      |
| вызовов через SIP, в которой работают 60 операторов, при средней            |
| продолжительности разговора 90 секунд и 30% успешных попыток дозвона до     |
| клиента рекомендуется сервер с двумя ядрами Intel Xeon 2,0 GHz или выше,    |
| диски стандарта SATA.                                                       |
|                                                                             |
| Аналогичный сервер обеспечит одновременную работу до 80 портов              |
| автоинформатора в режиме Progressive2 при прочих равных условиях.           |
+-----------------------------------------------------------------------------+

.. raw:: html

   </div>

--------------

 

Требования к программному обеспечению

•ОС Microsoft XP, Windows 2003, 2003 R2, 2008, 2008 R2, 2012 R2.
Редакции: Standard, Enterprise 32/64 бит;

•Cisco ® UCC Enterprise 7.х-11.6;

•Cisco ® UCC Express 7.x-11.6;

•Cisco ® IVR 7.х-8.5;

•Cisco ® Customer Voice Portal 7.0; 11.6;

•Cisco ® UCM 6.x-12.0;

•Cisco ® Border Element 15.1M&T, 15.2M&T,15.3M&T;

•Cisco ® Unified Sip Proxy 8.5, 8.6.

 

Требования к базе данных

•Microsoft SQL Server 2008, 2008 R2, 2012, 2016. Редакции: Express,
Standard, Enterprise 32/64 бит.

•Значение Collation SQL Server должно быть Cyrillic\_General\_CI\_AS.

 

Дополнительное программное обеспечение

•CTI Unified Configurator (устанавливается автоматически при наличии
дистрибутива инсталлятором CTI Outbound);

•Windows Installer 4.7 (требуется ручная установка);

•.NET Framework 4.0 (требуется ручная установка);

•.NET Framework 4.5+ (требуется ручная установка);

•Microsoft Visual C++ 2008 Redistributable 9.0 (требуется ручная
установка);

•Microsoft Visual C++ 2010 x86 Redistributable 10.0 (требуется ручная
установка);

•Microsoft Visual C++ 2010 x64 Redistributable 10.0 (требуется ручная
установка).

•Microsoft Visual C++ 2013 x86 Redistributable 10.0 (требуется ручная
установка);

•Microsoft Visual C++ 2013 x64 Redistributable 10.0 (требуется ручная
установка).

•Необходимо установить Desktop Experience (через Server Manager).

.. raw:: html

   <div class="header">

.. rubric:: #. Совместимость с другими продуктами
   :class: p_Heading1

.. raw:: html

   </div>

Система CTI Outbound версии 6.0 совместима со следующими продуктами:

.. raw:: html

   <div
   style="text-align: justify; text-indent: 0px; padding: 0px 0px 0px 0px; margin: 0px 0px 0px 0px;">

.. raw:: html

   <table class="cti_table" style="width:100%; background-color:#f2f2f2; border:solid 4px #ffffff; border-spacing:0px; border-collapse:collapse;">

.. raw:: html

   <tr style="text-align:left;vertical-align:middle;">

.. raw:: html

   <td rowspan="2" style="vertical-align:middle; background-color:#d3302b; padding:2px; border:solid 2px #ffffff;">

CTI Outbound

.. raw:: html

   </td>

.. raw:: html

   <td rowspan="2" style="vertical-align:middle; background-color:#d3302b; padding:2px; border:solid 2px #ffffff;">

Cisco ® Agent Desktop

.. raw:: html

   </td>

.. raw:: html

   <td rowspan="2" style="vertical-align:middle; background-color:#d3302b; padding:2px; border:solid 2px #ffffff;">

Cisco ® IVR

.. raw:: html

   </td>

.. raw:: html

   <td colspan="3" style="vertical-align:middle; background-color:#d3302b; padding:2px; border:solid 2px #ffffff;">

Cisco ® CVP

.. raw:: html

   </td>

.. raw:: html

   <td colspan="2" style="vertical-align:middle; background-color:#d3302b; padding:2px; border:solid 2px #ffffff;">

Cisco ® UCC Enterprise

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; background-color:#d3302b; padding:2px; border:solid 2px #ffffff;">

Cisco ® UCC

Express

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; background-color:#d3302b; padding:2px; border:solid 2px #ffffff;">

Cisco ® UCM

 

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; background-color:#d3302b; padding:2px; border:solid 2px #ffffff;">

Cisco ® Unified Border Element IOS

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; background-color:#d3302b; padding:2px; border:solid 2px #ffffff;">

Cisco ® Unified SIP Proxy

.. raw:: html

   </td>

.. raw:: html

   </tr>

.. raw:: html

   <tr style="text-align:left;vertical-align:middle;">

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

7.х

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

8.х

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

10.5

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

7.х-11.6

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

Parent/Child

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

7.х-11.6

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

6.x-12.0

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

15.1M&T-15.3 M&T

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

8.5.x-8.6.x

.. raw:: html

   </td>

.. raw:: html

   </tr>

.. raw:: html

   <tr style="text-align:left;vertical-align:middle;">

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

6.0

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+\*

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+\*\*

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

–

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+

.. raw:: html

   </td>

.. raw:: html

   <td style="vertical-align:middle; padding:2px; border:solid 2px #ffffff;">

+

.. raw:: html

   </td>

.. raw:: html

   </tr>

.. raw:: html

   </table>

.. raw:: html

   </div>

 

\* Без поддержки режима FullPreview.

\*\* Интеграция осуществляется с использованием HTTP–запросов,
поддерживаемых стандартными компонентами.

.. raw:: html

   <div class="header">

.. rubric:: #. Новый функционал
   :class: p_Heading1

.. raw:: html

   </div>

.. raw:: html

   <div
   style="text-align: justify; text-indent: 0px; padding: 0px 0px 0px 0px; margin: 0px 0px 0px 0px;">

+--------------------------------------+--------------------------------------+
| Идентификатор                        | Новый функционал                     |
+--------------------------------------+--------------------------------------+
| OUTBOUND-202                         | Добавлена возможность добавлять      |
|                                      | новых пользователей в CTI Outbound   |
|                                      | Administrator из под учетной записи, |
|                                      | отличной от outadmin                 |
+--------------------------------------+--------------------------------------+
| OUTBOUND-180                         | Добавлена возможность назначать      |
|                                      | права Администратора на вкладке      |
|                                      | "Администрирование" в CTI Outbound   |
|                                      | Administrator                        |
+--------------------------------------+--------------------------------------+
| OUTBOUND-175                         | Доработано описание настройки        |
|                                      | трансфера звонков с опцией "REFER".  |
+--------------------------------------+--------------------------------------+
| OUTBOUND-169                         | Добавлен API-метод редактирования    |
|                                      | атрибутов контакта в Outbound        |
|                                      | Management API.                      |
+--------------------------------------+--------------------------------------+
| OUTBOUND-165                         | Проведён рефакторинг инсталлятора    |
|                                      | для ManagementUI                     |
+--------------------------------------+--------------------------------------+
| [OUTBOUND-164                        | Проведён рефакторинг инсталлятора    |
|                                      | для Панели управления вызовами.      |
+--------------------------------------+--------------------------------------+
| OUTBOUND-163                         | Для отчетов ReportOverload и         |
|                                      | ReportOverloadForPP добавлена        |
|                                      | возможность разграничения прав на    |
|                                      | кампании                             |
+--------------------------------------+--------------------------------------+
| OUTBOUND-160                         | Изменена процедура развертывания баз |
|                                      | данных используемых в решении CTI    |
|                                      | Outbound (отказались от DBWizard в   |
|                                      | пользу скриптов PowerShell).         |
+--------------------------------------+--------------------------------------+
| OUTBOUND-158                         | Улучшена стабильность интеграции     |
|                                      | между компонентами CTI Outbound      |
|                                      | SipCaller и CTI Outbound             |
|                                      | VoiceAnalyzer.                       |
+--------------------------------------+--------------------------------------+
| OUTBOUND-157                         | Добавлена возможность указывать      |
|                                      | динамический UDP-порт в качестве     |
|                                      | локального порта SIP-транков.        |
+--------------------------------------+--------------------------------------+
| OUTBOUND-156                         | Улучшена работы с SIP - лучшее       |
|                                      | соответствие RFC в части             |
|                                      | ретрансмиссии SIP-сообщений.         |
+--------------------------------------+--------------------------------------+
| OUTBOUND-155                         | Переработана подсистема логирования  |
|                                      | в продукте.                          |
+--------------------------------------+--------------------------------------+
| OUTBOUND-153                         | Убрана поддержка TAPI.               |
+--------------------------------------+--------------------------------------+
| OUTBOUND-152                         | Устранено ограничение по             |
|                                      | максимальному значению звонков в     |
|                                      | минуту (callsPerMinute) в настройках |
|                                      | логических SIP-транков.              |
+--------------------------------------+--------------------------------------+
| OUTBOUND-112                         | Добавлена возможность не сбрасывать  |
|                                      | число попыток дозвона по телефону в  |
|                                      | процедуре перепланирования контакта  |
|                                      | (ContactReschedule).                 |
+--------------------------------------+--------------------------------------+
| OUTBOUND-9                           | Добавлено форматирование времени в   |
|                                      | схеме обработки звонка               |
+--------------------------------------+--------------------------------------+

.. raw:: html

   </div>

.. raw:: html

   <div class="header">

.. rubric:: #. Исправленные ошибки
   :class: p_Heading1

.. raw:: html

   </div>

.. raw:: html

   <div
   style="text-align: justify; text-indent: 0px; padding: 0px 0px 0px 0px; margin: 0px 0px 0px 0px;">

+--------------------------------------+--------------------------------------+
| Идентификатор                        | ОПИСАНИЕ ИСПРАВЛЕННОЙ ОШИБКИ         |
+--------------------------------------+--------------------------------------+
| OUTBOUND-392                         | Нельзя штатными средствами настроить |
|                                      | логирование dialer API, как итог     |
|                                      | сложность в диагностировании проблем |
|                                      | с обзвоном                           |
+--------------------------------------+--------------------------------------+
| OUTBOUND-387                         | В результат звонка фиксируется факт  |
|                                      | совершения трансфера в случае, когда |
|                                      | фактически трансфер не состоялся     |
|                                      | (например один из абонентов завершил |
|                                      | звонок на этапе трансфера)           |
+--------------------------------------+--------------------------------------+
| OUTBOUND-385                         | Не завершается звонок контакту при   |
|                                      | разрыве соединения со стороны IVR в  |
|                                      | режиме Predictive без парковки       |
+--------------------------------------+--------------------------------------+
| OUTBOUND-384                         | Сценарий Predictive без парковки     |
|                                      | продолжает работать при разрыве      |
|                                      | соединения со стороны IVR (до        |
|                                      | трансфера с контактом)               |
+--------------------------------------+--------------------------------------+
| OUTBOUND-383                         | Неверный результат звонка "Агент.    |
|                                      | Отбой звонка"                        |
|                                      | (ERROR\_AGENT\_DROP\_CALL) в режиме  |
|                                      | Predictive если контакт кладет       |
|                                      | трубку на этапе дозвона до агента    |
+--------------------------------------+--------------------------------------+
| OUTBOUND-381                         | Опечатка в тексте результата звонка  |
|                                      | "Агент. Звонок не попал на агента за |
|                                      | время отведенный таймаут"            |
+--------------------------------------+--------------------------------------+
| OUTBOUND-380                         | Неверный результат звонка "Ошибка    |
|                                      | трансфера" (ERROR\_TRANSFER) если во |
|                                      | время выполнения трансфера контакт   |
|                                      | положил трубку/                      |
+--------------------------------------+--------------------------------------+
| OUTBOUND-379                         | Неверный результат звонка "Агент.    |
|                                      | Нет ответа" (ERROR\_AGENT\_NOANSWER) |
|                                      | в режиме Predictive если контакт     |
|                                      | кладет трубку на этапе дозвона до    |
|                                      | агента                               |
+--------------------------------------+--------------------------------------+
| OUTBOUND-374                         | Не увеличивается число попыток       |
|                                      | дозвона по контакту в режиме         |
|                                      | Progressive2 при получении           |
|                                      | результата от IVR "316. Клиент не    |
|                                      | дослушал сообщение до конца"         |
+--------------------------------------+--------------------------------------+
| OUTBOUND-371                         | Ошибочная установка переменных       |
|                                      | звонка в контакт-центре если ранее   |
|                                      | совершался исходящий вызов на этот   |
|                                      | же номер телефона в режиме           |
|                                      | Predictive с парковкой на IVR и      |
|                                      | произошла ошибка на этапе трансфера  |
+--------------------------------------+--------------------------------------+
| OUTBOUND-364                         | В журнал звонков не записывается     |
|                                      | идентификатор агента при успешном    |
|                                      | дозвоне                              |
+--------------------------------------+--------------------------------------+
| OUTBOUND-360                         | `"Cannot insert the value NULL into  |
|                                      | column 'SubKey1Id', table            |
|                                      | 'Outbound6\_323.dbo.tContact'" при   |
|                                      | попытке импорта контакта через       |
|                                      | Management                           |
|                                      | API. <#osobennostiobnovlenja60.html> |
|                                      | `__                                  |
+--------------------------------------+--------------------------------------+
| OUTBOUND-359                         | Could not find stored procedure      |
|                                      | 'sSettingGet' при чистом             |
|                                      | разворачивании БД Outbound           |
+--------------------------------------+--------------------------------------+
| OUTBOUND-357                         | Не происходит подстановка имени      |
|                                      | контакта в шаблон сообщения в        |
|                                      | кампаниях с режимами обзвона Email и |
|                                      | SMS                                  |
+--------------------------------------+--------------------------------------+
| OUTBOUND-354                         | Падение службы CTI Outbound Dialer   |
|                                      | из-за ошибки                         |
|                                      | "System.NullReferenceException:      |
|                                      | Object reference not set to an       |
|                                      | instance of an object"               |
+--------------------------------------+--------------------------------------+
| OUTBOUND-353                         | Остановка обзвона из-за ошибки       |
|                                      | "Cannot insert duplicate key in      |
|                                      | object 'dbo.#contactIds'" при        |
|                                      | получении списка контактов к обзвону |
|                                      | (sOBDContactLst)                     |
+--------------------------------------+--------------------------------------+
| OUTBOUND-346                         | "Cannot insert the value NULL into   |
|                                      | column 'SubKey1Id', table            |
|                                      | 'Outbound5.dbo. tContact'; column    |
|                                      | does not allow nulls. UPDATE fails." |
|                                      | при обновлении БД Outbound до версии |
|                                      | 6.0.0.332 с 6.0.0.272                |
+--------------------------------------+--------------------------------------+
| OUTBOUND-342                         | В случае получения 491 Request       |
|                                      | Pending происходит множественная     |
|                                      | пересылка оригинального SIP запроса  |
|                                      | вместо единичной отправки (может     |
|                                      | проявляться как односторонняя        |
|                                      | слышимость)                          |
+--------------------------------------+--------------------------------------+
| OUTBOUND-341                         | Происходит завершения диалога после  |
|                                      | выполнения трансфера (не REFER),     |
|                                      | т.к. в режиме проксирования          |
|                                      | SIP-сообщений ACK пересылается с     |
|                                      | неверным CSeq                        |
+--------------------------------------+--------------------------------------+
| OUTBOUND-338                         | После выполнения трансфера при       |
|                                      | окончании диалога осуществляется     |
|                                      | повторная пересылка SIP запроса BYE  |
|                                      | после получения ответа               |
+--------------------------------------+--------------------------------------+
| OUTBOUND-333                         | "Transaction (Process ID 57) was     |
|                                      | deadlocked on lock resources with    |
|                                      | another process and has been chosen  |
|                                      | as the deadlock victim. Rerun the    |
|                                      | transaction" при вызове              |
|                                      | sAPIUserLogin                        |
+--------------------------------------+--------------------------------------+
| OUTBOUND-330                         | При установке базы данных с нуля не  |
|                                      | заполняется таблица временных зон    |
|                                      | (tTimeZone)                          |
+--------------------------------------+--------------------------------------+
| OUTBOUND-325                         | `Используется внутренний             |
|                                      | идентификатор SubKey вместо внешнего |
|                                      | идентификатора (SkGId) при загрузке  |
|                                      | общего                               |
|                                      | контакта <#ispolzovanie_subkey_skgid |
|                                      | .html>`__                            |
+--------------------------------------+--------------------------------------+
| OUTBOUND-323                         | "Object reference not set to an      |
|                                      | instance of an object" при           |
|                                      | отображении в Журнале звонков записи |
|                                      | с NULL номером телефона              |
+--------------------------------------+--------------------------------------+
| OUTBOUND-315                         | Контакты с заполненным SubKey3 не    |
|                                      | включаются в обзвон                  |
+--------------------------------------+--------------------------------------+
| OUTBOUND-311                         | "Unable to cast object of type       |
|                                      | 'System.String' to type              |
|                                      | 'OutboundAdmin.DAL.SubKeyTypeEntity' |
|                                      | "                                    |
|                                      | при изменении параметров кампании    |
+--------------------------------------+--------------------------------------+
| OUTBOUND-308                         | В документации не указано требование |
|                                      | к кодировке файла импорта CSV        |
+--------------------------------------+--------------------------------------+
| OUTBOUND-306                         | Базы данных Outbound и Statistics не |
|                                      | разворачиваются в экземпляре         |
|                                      | SQL-сервера версии 2008              |
+--------------------------------------+--------------------------------------+
| OUTBOUND-305                         | В CTIOutbound.AdminGuide.Ru(6.0):    |
|                                      | внесены дополнения и замечания       |
+--------------------------------------+--------------------------------------+
| OUTBOUND-205                         | Неверное описание параметров         |
|                                      | хранимой процедуры создания Фасадной |
|                                      | базы данных                          |
+--------------------------------------+--------------------------------------+
| OUTBOUND-204                         | The primary file must be at least 5  |
|                                      | MB to accommodate a copy of the      |
|                                      | model database" при выполнении       |
|                                      | процедуры [dbo].[sWrapperDBPrepare]  |
|                                      | БД Outbound                          |
+--------------------------------------+--------------------------------------+
| OUTBOUND-201                         | Невозможно создать нового            |
|                                      | пользователя в Outbound              |
|                                      | Administrator не из-под outadmin     |
+--------------------------------------+--------------------------------------+
| OUTBOUND-171                         | При обновлении с версии 5.x не       |
|                                      | применяются прежние настройки        |
|                                      | Конфигуратора.                       |
+--------------------------------------+--------------------------------------+
| OUTBOUND-168                         | После удаления пользователя          |
|                                      | Администратором, который работает в  |
|                                      | Outadmin, получаем множественные     |
|                                      | ошибки в Outbound Administrator..    |
+--------------------------------------+--------------------------------------+
| OUTBOUND-159                         | Пользователю доступна кнопка         |
|                                      | Экспорта журнала звонков на кампанию |
|                                      | при отсутствии соответствующих прав  |
+--------------------------------------+--------------------------------------+
| OUTBOUND-149                         | В OutboundAdmin отсутствует          |
|                                      | маштабирование меню и элементов.     |
+--------------------------------------+--------------------------------------+
| OUTBOUND-148                         | "Remote function reference           |
|                                      | 'OUTBOUND.Outbound5.dbo.CheckUserRig |
|                                      | ht'                                  |
|                                      | is not allowed" при попытке          |
|                                      | развернуть БД Статистики на          |
|                                      | отдельном от Outbound сервере.       |
+--------------------------------------+--------------------------------------+
| OUTBOUND-146                         | Неверные версии продукта в           |
|                                      | наименованиях служб в Services       |
+--------------------------------------+--------------------------------------+
| OUTBOUND-136                         | Не отображается панель               |
|                                      | редактирования атрибутов контактов в |
|                                      | OutAdmin                             |
+--------------------------------------+--------------------------------------+
| OUTBOUND-132                         | Progressive2: Неверный результат     |
|                                      | обработки контакта, если определена  |
|                                      | "Тишина".                            |
+--------------------------------------+--------------------------------------+
| OUTBOUND-131                         | Progressive2: Неверный результат     |
|                                      | обработки контакта, если клиент не   |
|                                      | берет трубку.                        |
+--------------------------------------+--------------------------------------+
| OUTBOUND-130                         | Predictive, Progressive: Неверный    |
|                                      | результат обработки контакта, если   |
|                                      | клиент не берет трубку.              |
+--------------------------------------+--------------------------------------+
| OUTBOUND-122                         | Отсутствует дистрибутив              |
|                                      | UnifiedConfiguratorSetup.exe в       |
|                                      | комплекте поставки CTI Outbound 6.X. |
+--------------------------------------+--------------------------------------+
| OUTBOUND-121                         | Неверная версия продукта в           |
|                                      | наименованиях файлов .exe, в         |
|                                      | диалоговых окнах установки и в       |
|                                      | "Programs and Features"              |
+--------------------------------------+--------------------------------------+
| OUTBOUND-117                         | Неверное значение [VCProductVersion] |
|                                      | в таблице [tSettings] баз данных     |
|                                      | [Outbound] и [OutboundStatistics]    |
|                                      | версии 6.X.                          |
+--------------------------------------+--------------------------------------+
| OUTBOUND-100                         | Некорректная версия библиотеки       |
|                                      | CTI.Dialer.API.dll, версия 5.6.      |
+--------------------------------------+--------------------------------------+
| OUTBOUND-88                          | Отсутствует дистрибутив Cisco CVP    |
|                                      | Integration в комплекте поставки CTI |
|                                      | Outbound 5.6                         |
+--------------------------------------+--------------------------------------+
| OUTBOUND-85                          | Неверная кодировка текста в          |
|                                      | инсталляторе CTI Outbound  5.6       |
|                                      | Server.                              |
+--------------------------------------+--------------------------------------+
| OUTBOUND-59                          | Замедление работы Outbound           |
|                                      | Administrator при переходе с вкладки |
|                                      | "Кампнии на вкладку                  |
|                                      | "Администрирование" при большом      |
|                                      | числе кампаний (~ 5000)              |
+--------------------------------------+--------------------------------------+

.. raw:: html

   </div>

.. raw:: html

   <div class="header">

.. rubric:: #. Использование внешнего идентификатора (SkGId) SubKey вместо
   внутренного идентификатора при загрузке общего контакта
   :class: p_Heading1

.. raw:: html

   </div>

Выборка контактов для обзвона теперь производится по полю  SkGId
(внешнему ключу) таблицы tSubKey, а не по полю SkId (внутреннему ключу).

 

При обновлении Outbound 6 до версии с данным исправлением, в столбец
SkGId таблицы tSubKey перенесутся данные из столбца SkId, если в
соответствующей ячейке SkGId было значение NULL.

.. raw:: html

   <div
   style="text-align: justify; text-indent: 0px; padding: 0px 0px 0px 0px; margin: 0px 0px 0px 0px;">

+--------------------------------------+--------------------------------------+
| .. raw:: html                        |   Внимание !                         |
|                                      |                                      |
|    <div style="text-align: center;"> | Если при обновлении у заказчика      |
|                                      | заполнены поля SkGId в таблице       |
| |warning|                            | tSubKey, то сломается интеграция     |
|                                      |                                      |
| .. raw:: html                        |                                      |
|                                      |                                      |
|    </div>                            |                                      |
+--------------------------------------+--------------------------------------+

.. raw:: html

   </div>

--------------

 

.. raw:: html

   <div class="header">

.. rubric:: #. Известные ошибки и ограничения
   :class: p_Heading1

.. raw:: html

   </div>

.. raw:: html

   <div
   style="text-align: justify; text-indent: 0px; padding: 0px 0px 0px 0px; margin: 0px 0px 0px 0px;">

+--------------------------------------+--------------------------------------+
| Идентификатор                        | ОПИСАНИЕ  ОШИБКИ (ограничения)       |
+--------------------------------------+--------------------------------------+
| OUTBOUND-367                         | `"The Service Broker in database     |
|                                      | %DatabaseName% cannot be enabled     |
|                                      | because there is already an enabled  |
|                                      | Service Broker with the same ID."    |
|                                      | при обновлении БД Outbound и\\или    |
|                                      | OutboundStatistics <#osobennostiobno |
|                                      | vlenja60>`__                         |
+--------------------------------------+--------------------------------------+
| OUTBOUND-368                         | `"Cannot create a new Service Broker |
|                                      | in  a mirrored database" при         |
|                                      | обновлении БД Outbound и\\или        |
|                                      | OutboundStatistics с настроенным     |
|                                      | зеркалированием или в конфигурации   |
|                                      | Always-On <#osobennostiobnovlenja60. |
|                                      | html>`__                             |
+--------------------------------------+--------------------------------------+
| OUTBOUND-183                         |  Нельзя установить\\обновить базы    |
|                                      | данных Outbound и OutboundStatistics |
|                                      | с использованием                     |
|                                      | Windows-аутентификации на SQL        |
|                                      | Server/                              |
+--------------------------------------+--------------------------------------+

.. raw:: html

   </div>

.. raw:: html

   <div class="header">

.. rubric:: #. Особенности обновления
   :class: p_Heading1

.. raw:: html

   </div>


================================ ==========================================================================================================================================================================================================================================================================================================================================
           Заголовок                        Описание                         
================================ ==========================================================================================================================================================================================================================================================================================================================================
 OUTBOUND-183                     Нельзя установить\\обновить базы
 OUTBOUND-183                     Нельзя установить\\обновить базы данных Outbound и OutboundStatistics данных Outbound и OutboundStatistics данных Outbound и OutboundStatistics данных Outbound и OutboundStatistics данных Outbound и OutboundStatistics данных Outbound и OutboundStatistics данных Outbound и OutboundStatistics данных Outbound и OutboundStatistics
 OUTBOUND-183                     Нельзя установить\\обновить базы данных Outbound и OutboundStatistics данных Outbound и OutboundStatistics
 OUTBOUND-183                     Нельзя установить\\обновить базы
================================ ==========================================================================================================================================================================================================================================================================================================================================

ЗНАЧЕНИЕ ПАРАМЕТРА COLLATION

В БД Outbound в таблице tContactLog колонка ccContactLogId с вычисляемым
значением имеет collation Cyrillic\_General\_CI\_AS.

По требованию заказчика мы как сторона исполнителя можем сформировать
новый OutboundDB.dacpac c запрашиваемым collation, т.к. от этого будет
зависеть параметры сортировки указанного столбца таблицы

ПРИ ОБНОВЛЕНИИ С ВЕРСИИ 5.X НЕ ПРИМЕНЯЮТСЯ ПРЕЖНИЕ НАСТРОЙКИ
КОНФИГУРАТОРА

CTI Outbound хранит настройки в реестре в ветке "CTI Outbound <Major
номер версии>", из-за изменения Major версии с 5 на 6 все настройки
остались в "старой" ветке реестра. Перед установкой нужно сделать ручное
копирование root-ветки реестра.

Настройка аутентификации пользователей и источников данных в системе
отчётности

В систему отчётности добавлена возможность Windows аутентификации
пользователей и возможность учёта прав пользователей на кампании обзвона
при генерации отчёта. Подробности в разделе "2. Настройка аутентификации
пользователей и источников данных" документа CTI Outbound - Описание
отчётности.

Для успешного импорта контактов в кампанию через Managment API порядок
атрибутов контакта должен быть следующим:

#. AgentId

#. ContactGID

#. FirstName

#. LastName

#. MiddleName

#. NextCallTime

#. Phones

#. TimeZoneInfoName

#. UserAttributes

#. GroupName

#. Priority

#. Type

#. SkGid1

#. SkGid2

#. SkGid3.



Особенности обновления БД Outbound и\\или OutboundStatistics с
настроенным зеркалированием или в конфигурации Always-On

При обновлении БД Outbound и\\или OutboundStatistics с включенным
зеркалированием или в конфигурации Always-On может произойти ошибка
"Cannot create a new Service Broker in a mirrored database".

В этом случае необходимо:

1.разорвать зеркалирование;

2.обновить БД;

3.восстановить зеркалирование.

 

Если обновление прерывается с ошибкой "The Service Broker in database
Outbound (или OutboundStatistics)  cannot be enabled because there is
already an enabled Service Broker with the same ID." , то требуется
выполнить скрипт:

USE [master]

GO

ALTER DATABASE [%DatabaseName%] SET NEW\_BROKER

GO

 

.. |warning| image:: warning.gif
.. |information| image:: information.gif
